Revit 2027 API
MacroModuleIterator.CurrentObject Property
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
internal Object CurrentObject { get; }
Friend ReadOnly Property CurrentObject As Object
	Get
internal:
virtual property Object^ CurrentObject {
	Object^ get () sealed;
}
internal abstract CurrentObject : Object with get
internal override CurrentObject : Object with get
Property Value
Object
Implements
IEnumerator.Current
See Also
Reference
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace